<a href="https://colab.research.google.com/github/CamoinLancelot/Database-INHA/blob/main/LabWeek9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
from sqlalchemy import create_engine

conn = create_engine("sqlite:////content/my_db.db")

In [32]:
from sqlalchemy.exc import SQLAlchemyError

try:
  conn.execute('''DROP table student''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)

student table deleted

In [33]:
tables = conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in tables:
  print(row)

('category',)
('subcategory',)

In [34]:
with open("student_tables.sql","r")as file:
  query = file.read()
  conn.execute(query)

In [35]:
tables = conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in tables:
  print(row)

('category',)
('subcategory',)
('student',)

In [36]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

In [37]:
with open("student_insert.sql","r")as file:
  query = file.read()
  conn.execute(query)

In [43]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [47]:
from sqlalchemy.exc import SQLAlchemyError

try:
  edits=conn.execute('''UPDATE student SET mark=mark+1 WHERE id=7 ''')
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("number of row edited: ",edits.rowcount)

number of row edited:  1

In [ ]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [46]:
from sqlalchemy.exc import SQLAlchemyError

try:
  edits = conn.execute('''UPDATE student SET mark=mark+1 WHERE class='Four' ''')
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("number of row edited: ",edits.rowcount)

number of row edited:  6

In [45]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [50]:
from sqlalchemy.exc import SQLAlchemyError

try:
  id = input("enter the student id: ")
  data = (id,)
  edits = conn.execute('''update student set mark=mark+5 where id=?''',data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("number of edits: ",edits.rowcount)

enter the student id: 2
number of edits:  1

In [52]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

(1, 'John Deo', 'Four', 82, 'female')
(2, 'Max Ruin', 'Three', 90, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Six', 86, 'female')
(29, 'Tess Played', 'Six', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Six', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Six', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [51]:
from sqlalchemy.exc import SQLAlchemyError

try:
  data = ('Six','Seven')
  edits = conn.execute('''update student set class=? where class=?''',data)
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("number of edits: ",edits.rowcount)

number of edits:  4

In [53]:
students = conn.execute('''select * from student''')
for row in students:
  print(row)

(1, 'John Deo', 'Four', 82, 'female')
(2, 'Max Ruin', 'Three', 90, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Six', 86, 'female')
(29, 'Tess Played', 'Six', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Six', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Six', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [55]:
from sqlalchemy.exc import SQLAlchemyError
try:
  classes = conn.execute('''select distinct(class) from student''')
  data = classes.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("number of rows: ",len(data))

Four
Three
Five
Six
number of rows:  4